alphabet = " ,.!?#абвгдеёжзийклмнопрстуфхцчшщъыьэюя1234567890АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
contours = [[["ю",'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р', 'С','Т',"У",'Ф','Х','Ц','Ч','Ш',"Щ","Ъ","Ы","Ь","Э","Ю","Я", "ц", "и", " ", ",", "!", "?", ".", "#", "е", "щ", "ы", "к", "в", "т", "ф", "й", "з", "ь", "д", "л",
              "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "х", "м", "р", "ж", "п", "г", "э", "ъ", "ё", "ч", "ш",
              "о", "с", "н", "у", "а", "б", "я"],
             ["ш", "и", "ю", " ", ",", "!", "?", "1",'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р', 'С','Т',"У",'Ф','Х','Ц','Ч','Ш',"Щ","Ъ","Ы","Ь","Э","Ю","Я", "2", "3", "4", "5", "6", "7", "8", "9", ".", "#", "х", "т", "с",
              "к", "м", "ы", "п", "в", "д", "б", "й", "г", "о", "щ", "ц", "ъ", "ь", "р", "а", "ж", "л", "я", "э", "е",
              "ё", "у", "н", "з", "ч", "ф"],
             ["г", "ц", "с", "ч", " ", ",", "!", "?", ".", "#", "н", "и", "з", "р", "б", "ы", "щ", "е", "я", "х", "п",
              "ю", "э", "т", "д", "о", "в", "у", "ь", "м", "ё", 'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р', 'С','Т',"У",'Ф','Х','Ц','Ч','Ш',"Щ","Ъ","Ы","Ь","Э","Ю","Я","ш", "а", "л", "ж", "ъ", "ф", "й", "к", "1", "2", "3",
              "4", "5", "6", "7", "8", "9", ]],
            [["я", 'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р', 'С','Т',"У",'Ф','Х','Ц','Ч','Ш',"Щ","Ъ","Ы","Ь","Э","Ю","Я","и", "ц", " ", ",", "5", "?", ".", "9", "е", "х", "ы", "к", "в", "п", "ф", "й", "з", "ь", "д", "л",
              "1", "2", "3", "4", "6", "!", "7", "8", " #", "0", "щ", "м", "р", "ж", "т", "г", "э", "ъ", "ё", "ч", "ш",
              "о", "с", "у", "н", "а", "б", "ю"],
             ["ш", "и", "ю", " ", ",", "!", "?", "1", "2", "о", "4", "5", "6", "ь", "8", "9", ".", "#", "х", "т", "с",
              "к", "ы", "м", "п", "в", "д", "б", "й", "г","А","Б","В","Г","Д","Е","Ё","Ж","З","И","Й","К","Л","М","Н","О","П","Р", "С","Т","У","Ф","Х","Ц","Ч","Ш","Щ","Ъ","Ы","Ь","Э","Ю","Я", "3", "щ", "ц", "ъ", "7", "р", "ж", "л", "а", "я", "э", "е",
              "ё", "у", "з", "н", "ч", "ф"],
             ]]
print(*contours[0][2])
enter = input("Введите текст:")

change = int(input("Что вам нужно? Выберите цифру \n1)Зашифровать\n2)Расшифровать"))
k = 0


output = ""
for i in range(len(enter)):
    if change == 1:
        output += contours[k][alphabet.find(enter[i])]

    elif change == 2:
        member = contours[k]
        member = member.index(enter[i])
        output += alphabet[member]


    if k >= len(contours) - 1:
        k = 0
    else:
        k += 1

print(output)














